*&---------------------------------------------------------------------*
*&  Include           MYEZFI0100O01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  INIT_0100  OUTPUT
*&---------------------------------------------------------------------*
*       100번 화면 초기화
*----------------------------------------------------------------------*
MODULE INIT_0100 OUTPUT.

*----------------------------------------------------------------------*
* 프로그램 시작
*----------------------------------------------------------------------*
  IF ( GV_START IS INITIAL ).
    GV_START = ABAP_TRUE.

*   광역변수 초기화
    PERFORM INIT_FOR_NEW_START.

*   Sublogin 에 대한 사용자 정보를 가져 온다.
    PERFORM CHECK_SUBLOGIN_PROC.

*   회사코드 정보 설정
    YEZFIS0060-BUKRS  = GS_SUBLOGIN-BUKRS.
    YEZFIS0060-BUTXT  = GS_SUBLOGIN-BUTXT.

    PERFORM GET_COMPANY_INFO.
*----------------------------------------------------------------------*
* 전표번호 입력
*----------------------------------------------------------------------*
  ELSE.
*   새로운 전표 조회 시 광역변수 초기화
    PERFORM INIT_FOR_NEW_ENTRY.
  ENDIF.

* 전표 초기값 설정
  PERFORM SET_BELNR_PARAMETER.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  STATUS_0100  OUTPUT
*&---------------------------------------------------------------------*
*       100번 화면 상태
*----------------------------------------------------------------------*
MODULE STATUS_0100 OUTPUT.

  SET PF-STATUS 'M100'.
  SET TITLEBAR '100' WITH TEXT-T01.                " [FI] 전표 조회

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  STATUS_0200  OUTPUT
*&---------------------------------------------------------------------*
*       200번 화면 초기화
*----------------------------------------------------------------------*
MODULE STATUS_0200 OUTPUT.

  SET PF-STATUS 'M200'.
  SET TITLEBAR '200' WITH TEXT-T02.                " [FI] 전표 조회

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  SET_ALV_GRID_0200  OUTPUT
*&---------------------------------------------------------------------*
*       200번 화면 ALV GRID 구성
*----------------------------------------------------------------------*
MODULE SET_ALV_GRID_0200 OUTPUT.

*----------------------------------------------------------------------*
* Create ALV
*----------------------------------------------------------------------*
  IF ( GO_CONTAINER_0200 IS INITIAL ).
    PERFORM SET_ALV_CONTAINER_0200.
    PERFORM SET_ALV_LAYOUT_0200.
    PERFORM SET_ALV_SORT_0200.
    PERFORM SET_ALV_FIELDCAT_0200.
    PERFORM ALV_ALV_DISPLAY_0200.
*----------------------------------------------------------------------*
* Refresh ALV
*----------------------------------------------------------------------*
  ELSE.
    PERFORM REFRESH_ALV_0200.
  ENDIF.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  MODIFY_0200  OUTPUT
*&---------------------------------------------------------------------*
*       200번 화면 속성 변경
*----------------------------------------------------------------------*
MODULE MODIFY_0200 OUTPUT.

  LOOP AT SCREEN.
    IF ( SCREEN-NAME = 'YEZFIS0070-HWAER' ).
      IF ( YEZFIS0070-WAERS = YEZFIS0070-HWAER  ).
        SCREEN-INVISIBLE = 1.
      ELSE.
        SCREEN-INVISIBLE = 0.
      ENDIF.

      MODIFY SCREEN.
    ENDIF.
  ENDLOOP.

ENDMODULE.
