*&---------------------------------------------------------------------*
*&  Include           YEZFIR0040_I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT_0100  INPUT
*&---------------------------------------------------------------------*
*       100번 화면 종료명령어 처리
*----------------------------------------------------------------------*
MODULE EXIT_0100 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
    WHEN 'BACK_0100' OR
         'EXIT_0100' OR
         'CANC_0100'.
      LEAVE TO SCREEN 0.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  CHECK_INPUT_0100  INPUT
*&---------------------------------------------------------------------*
*       100번 화면 입력값 처리
*----------------------------------------------------------------------*
MODULE CHECK_INPUT_0100 INPUT.

* 새로운 전표를 위한 광역변수 초기화
  PERFORM INIT_FOR_NEW_ENTRY.

* 전표 번호 점검
  PERFORM CHECK_DOCUMENT_NO USING YEZFIS0060-BUKRS
                                  YEZFIS0060-BELNR
                                  YEZFIS0060-GJAHR.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       100번 화면 사용자 명령어 처리
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0100 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
*   계속
    WHEN 'ENTE_0100'.
      PERFORM DISPLAY_DOCUMENT_DETAIL.    " 전표 상세내역 조회
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  EXIT_0200  INPUT
*&---------------------------------------------------------------------*
*       200번 화면 종료명령어 처리
*----------------------------------------------------------------------*
MODULE EXIT_0200 INPUT.

  CALL METHOD GO_GRID_0211->FREE.
  CALL METHOD GO_CUST_0211->FREE.
  CALL METHOD CL_GUI_CFW=>FLUSH.

* 화면 종료
  IF ( GV_CALLD IS NOT INITIAL ).
    LEAVE PROGRAM.
  ELSE.
    LEAVE TO SCREEN 0.
  ENDIF.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0200  INPUT
*&---------------------------------------------------------------------*
*       200번 화면 사용자 명령어 처리
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0200 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
    WHEN 'SELB'.
      PERFORM CALL_STD_FB03.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  GET_SASH_HOR_0210  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE GET_SASH_HOR_0210 INPUT.

  go_splitter_hor->get_guisash( ).

ENDMODULE.
