*&---------------------------------------------------------------------*
*&  Include           YEZFII0100_I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       100번 화면 종료명령어 처리
*----------------------------------------------------------------------*
MODULE EXIT_COMMAND_0100 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
    WHEN 'BACK_0100' OR 'EXIT_0100' OR 'CANC_0100'.
      PERFORM EXIT_SCREEN_0100.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*      100번 화면 사용자 명령어 처리
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0100 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
*   100번 화면 저장 이벤트 처리
    WHEN 'SAVE_0100'.
      PERFORM SAVE_DATA_0100.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  EXIT_COMMAND_0200  INPUT
*&---------------------------------------------------------------------*
*       200번 화면 종료명령어 처리
*----------------------------------------------------------------------*
MODULE EXIT_COMMAND_0200 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
    WHEN 'BACK_0200' OR 'EXIT_0200' OR 'CANC_0200'.
      PERFORM EXIT_SCREEN_0200.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0200  INPUT
*&---------------------------------------------------------------------*
*      200번 화면 사용자 명령어 처리
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0200 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

ENDMODULE.
