*----------------------------------------------------------------------*
***INCLUDE LYFIF0030I01.
*----------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       100번 화면 종료명령어 처리
*----------------------------------------------------------------------*
MODULE EXIT_COMMAND_0100 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
    WHEN 'CANC_0100'.
      PERFORM CANCEL_SELECT_EMPNO.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*      100번 화면 사용자 명령어 처리
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0100 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
*   회사코드 선택 이벤트 처리
    WHEN 'BUKRS_0100'.
      PERFORM BUKRS_SELECT_EVENT.
*   사원번호 선택 이벤트 처리
    WHEN 'EMPNO_0100'.
      PERFORM EMPNO_SELECT_EVENT.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  F4_BUKRS_0100  INPUT
*&---------------------------------------------------------------------*
*       회사코드 F4 HELP
*----------------------------------------------------------------------*
MODULE F4_BUKRS_0100 INPUT.

  PERFORM F4_HELP_BUKRS USING 'YEZFIS0030-BUKRS'.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  F4_EMPNO_0100  INPUT
*&---------------------------------------------------------------------*
*       사원번호 F4 HELP
*----------------------------------------------------------------------*
MODULE F4_EMPNO_0100 INPUT.

  PERFORM F4_HELP_EMPNO USING 'YEZFIS0030-EMPNO'.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  EXIT_COMMAND_0200  INPUT
*&---------------------------------------------------------------------*
*       200번 화면 종료명령어 처리
*----------------------------------------------------------------------*
MODULE EXIT_COMMAND_0200 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
    WHEN 'CANC_0200'.
      PERFORM CANCEL_SELECT_AUTH.
  ENDCASE.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0200  INPUT
*&---------------------------------------------------------------------*
*      200번 화면 사용자 명령어 처리
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0200 INPUT.

  SAVE_OK = OK_CODE.
  CLEAR OK_CODE.

  CASE SAVE_OK.
*   권한 선택 이벤트 처리
    WHEN 'ENTER_0200'.
      PERFORM AUTH_SELECT_EVENT.
  ENDCASE.

ENDMODULE.
