************************************************************************
* Program ID  : YEZFIR1000
* Title       : [FI] 전표 조회 및 상신
* Module      : FI
* Type        : Report
* Description : 전표 결재상신 및 그 결과 조회
************************************************************************

*----------------------------------------------------------------------*
* INCLUDES
*----------------------------------------------------------------------*
INCLUDE YEZFIR1000_TOP.
INCLUDE YEZFIR1000_C01.
INCLUDE YEZFIR1000_F01.
INCLUDE YEZFIR1000_F02.
INCLUDE YEZFIR1000_F03.
INCLUDE YEZFIR1000_F04.
INCLUDE YEZFIR1000_O01.
INCLUDE YEZFIR1000_I01.

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN                                                  *
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SELSCR_PROC.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.

* 초기화
  PERFORM INIT_PROC.

* 자료 선택 및 구성
  PERFORM MAKE_OUTTAB_PROC.

* 조회화면 호출
  PERFORM CALL_SCREEN_0100.

*----------------------------------------------------------------------*
* END-OF-SELECTION
*----------------------------------------------------------------------*
END-OF-SELECTION.
