*&---------------------------------------------------------------------*
*&  Include           YEZFIR1000_O01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  STATUS_0100  OUTPUT
*&---------------------------------------------------------------------*
*       100번 화면 초기화
*----------------------------------------------------------------------*
MODULE STATUS_0100 OUTPUT.

  CLEAR: GT_EXCLUDE[].

  CASE GV_DYNNR.
    WHEN '0110'.
      PERFORM APPEND_MENU USING: 'NEWGR',
                                 'DELGR',
                                 '&REQ',
                                 '&DEL'.
    WHEN '0120'.
    WHEN '0130'.
      PERFORM APPEND_MENU USING: 'NEWGR',
                                 'DELGR',
                                 '&REQ',
                                 '&DEL'.
  ENDCASE.

  SET PF-STATUS 'M100' EXCLUDING GT_EXCLUDE[].
  SET TITLEBAR '100' WITH TEXT-T07.          " [FI] 전표 조회 및 상신

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  SET_ALV_GRID_0110  OUTPUT
*&---------------------------------------------------------------------*
*       100번 화면 ALV GRID 구성
*----------------------------------------------------------------------*
MODULE SET_ALV_GRID_0110 OUTPUT.

*----------------------------------------------------------------------*
* Create ALV
*----------------------------------------------------------------------*
  IF ( GO_CUST_0110 IS INITIAL ).
    PERFORM SET_ALV_CONTAINER_0110.
    PERFORM SET_ALV_LAYOUT_0110.
    PERFORM SET_ALV_SORT_0110.
    PERFORM SET_ALV_FIELDCAT_0110.
    PERFORM ALV_ALV_DISPLAY_0110.
    PERFORM SET_EVENT_HANDLER_0110.

*----------------------------------------------------------------------*
* Refresh ALV
*----------------------------------------------------------------------*
  ELSE.
    PERFORM REFRESH_ALV_0110.
  ENDIF.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  SET_ALV_GRID_0120  OUTPUT
*&---------------------------------------------------------------------*
*       100번 화면 ALV GRID 구성
*----------------------------------------------------------------------*
MODULE SET_ALV_GRID_0120 OUTPUT.

*----------------------------------------------------------------------*
* Create ALV
*----------------------------------------------------------------------*
  IF ( GO_CUST_0120 IS INITIAL ).
    PERFORM SET_ALV_CONTAINER_0120.
    PERFORM SET_ALV_LAYOUT_0120.
    PERFORM SET_ALV_SORT_0120.
    PERFORM SET_ALV_FIELDCAT_0120.
    PERFORM ALV_ALV_DISPLAY_0120.
    PERFORM SET_EVENT_HANDLER_0120.

*----------------------------------------------------------------------*
* Refresh ALV
*----------------------------------------------------------------------*
  ELSE.
    PERFORM REFRESH_ALV_0120.
  ENDIF.

ENDMODULE.

*&---------------------------------------------------------------------*
*&      Module  SET_ALV_GRID_0130  OUTPUT
*&---------------------------------------------------------------------*
*       100번 화면 ALV GRID 구성
*----------------------------------------------------------------------*
MODULE SET_ALV_GRID_0130 OUTPUT.

*----------------------------------------------------------------------*
* Create ALV
*----------------------------------------------------------------------*
  IF ( GO_CUST_0130 IS INITIAL ).
    PERFORM SET_ALV_CONTAINER_0130.
    PERFORM SET_ALV_LAYOUT_0130.
    PERFORM SET_ALV_SORT_0130.
    PERFORM SET_ALV_FIELDCAT_0130.
    PERFORM ALV_ALV_DISPLAY_0130.
    PERFORM SET_EVENT_HANDLER_0130.

*----------------------------------------------------------------------*
* Refresh ALV
*----------------------------------------------------------------------*
  ELSE.
    PERFORM REFRESH_ALV_0130.
  ENDIF.

ENDMODULE.
